# Analyzing Student Grades# Submarine problem

In [12]:
import pandas as pd

In [13]:
student_data = {
    'Student': ['John', 'Sara', 'Mike', 'Anna', 'David', 'Emily', 'Chris', 'Sophia'],
    'Subject': ['Math', 'Science', 'Math', 'Science', 'Math', 'Science', 'Math', 'Science'],
    'Marks': [85, 72, 90, 65, 78, 88, 92, 55],
    'Attendance': [92, 80, 95, 70, 85, 90, 97, 60]
}
student_d=pd.DataFrame(student_data)
student_d

  Student  Subject  Marks  Attendance
0    John     Math     85          92
1    Sara  Science     72          80
2    Mike     Math     90          95
3    Anna  Science     65          70
4   David     Math     78          85
5   Emily  Science     88          90
6   Chris     Math     92          97
7  Sophia  Science     55          60

In [14]:
student_d.groupby("Subject")["Marks"].mean()

Subject
Math       86.25
Science    70.00
Name: Marks, dtype: float64

In [15]:
filtered=student_d[(student_d["Attendance"]<90) & (student_d["Marks"])]
print(filtered)

  Student  Subject  Marks  Attendance
3    Anna  Science     65          70
7  Sophia  Science     55          60

In [16]:
student_d["Grade"]=student_d["Marks"].apply(lambda x: "A" if x>=90 else "B" if(x>=80 & x<90) else "c" if (x>=70 & x<80) else "D" )
print(student_d)

  Student  Subject  Marks  Attendance Grade
0    John     Math     85          92     B
1    Sara  Science     72          80     B
2    Mike     Math     90          95     A
3    Anna  Science     65          70     B
4   David     Math     78          85     B
5   Emily  Science     88          90     B
6   Chris     Math     92          97     A
7  Sophia  Science     55          60     B

In [17]:
student_d.groupby("Grade")["Student"].count()
# student_d.columns

Grade
A    2
B    6
Name: Student, dtype: int64

In [18]:
# student_d[["Marks","Attendance"].corr()

correlation=student_d[["Marks", "Attendance"]].corr()
relationship=correlation.loc["Marks","Attendance"]

In [19]:
if relationship>0:
    print("Stongly effecting ")
elif relationship<0:
    print("No Effect")
else:
    print("No reletionship among them")

Stongly effecting

# Employee Salary Insights

In [20]:
data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Emma', 'Frank', 'Grace', 'Hannah'],
    'Department': ['HR', 'IT', 'IT', 'HR', 'Finance', 'Finance', 'IT', 'HR'],
    'Age': [25, 32, 29, 41, 37, 45, 26, 38],
    'Salary': [50000, 70000, 65000, 80000, 75000, 90000, 62000, 85000],
    'Experience': [2, 7, 5, 15, 10, 20, 3, 12]
}
e=pd.DataFrame(data)
e

  Employee Department  Age  Salary  Experience
0    Alice         HR   25   50000           2
1      Bob         IT   32   70000           7
2  Charlie         IT   29   65000           5
3    David         HR   41   80000          15
4     Emma    Finance   37   75000          10
5    Frank    Finance   45   90000          20
6    Grace         IT   26   62000           3
7   Hannah         HR   38   85000          12

In [21]:
department=e.groupby(by="Department").count()
print(department)

            Employee  Age  Salary  Experience
Department
Finance            2    2       2           2
HR                 3    3       3           3
IT                 3    3       3           3

In [22]:
Avg_Salary=e.groupby("Department")["Salary"].mean()
print(Avg_Salary)

Department
Finance    82500.000000
HR         71666.666667
IT         65666.666667
Name: Salary, dtype: float64

In [23]:
max_salary=e.groupby(["Department","Employee"])["Salary"].max()
max_salary1=e.loc[e.groupby("Department")["Salary"].idxmax()]

print(max_salary1)

  Employee Department  Age  Salary  Experience
5    Frank    Finance   45   90000          20
7   Hannah         HR   38   85000          12
1      Bob         IT   32   70000           7

In [24]:
pos=e.groupby("Department")["Salary"].idxmax()
print(pos)

Department
Finance    5
HR         7
IT         1
Name: Salary, dtype: int64

In [25]:
mul=e.groupby("Department")["Salary"].agg(["min", "max", "mean"])
mul

              min    max          mean
Department
Finance     75000  90000  82500.000000
HR          50000  85000  71666.666667
IT          62000  70000  65666.666667

In [26]:
# df['Seniority']=df['Seniority'].apply(lambda X: "Junior" if X<5  "Mid-Level" if <10 else "Senior")
e['Seniority'] = e['Experience'].apply(lambda x: "Junior" if x < 5 else "Mid-Level" if x < 10 else "Senior")
print(e)

  Employee Department  Age  Salary  Experience  Seniority
0    Alice         HR   25   50000           2     Junior
1      Bob         IT   32   70000           7  Mid-Level
2  Charlie         IT   29   65000           5  Mid-Level
3    David         HR   41   80000          15     Senior
4     Emma    Finance   37   75000          10     Senior
5    Frank    Finance   45   90000          20     Senior
6    Grace         IT   26   62000           3     Junior
7   Hannah         HR   38   85000          12     Senior

In [27]:
sort_it=e.sort_values(by='Salary', ascending=False) # Descending order
sort_it.groupby("Department")["Salary"].max()

Department
Finance    90000
HR         85000
IT         70000
Name: Salary, dtype: int64

In [28]:
it_e=e[e["Department"]=="IT"]
it_e.sort_values(by="Salary",ascending=False)

  Employee Department  Age  Salary  Experience  Seniority
1      Bob         IT   32   70000           7  Mid-Level
2  Charlie         IT   29   65000           5  Mid-Level
6    Grace         IT   26   62000           3     Junior